update docs with diagram
